БылковДА70180166/src/Documents/ПриказОбОтчислении/ПриказОбОтчислении.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказОбОтчислении</name>
  <basedOn>Document.ПротоколЗаседанияКомиссии</basedOn>
  <registerRecords>AccumulationRegister.ПросроченныеЗадолженности</registerRecords>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПротоколЗаседанияКомиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтчисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтчисляемыеСтуденты</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.Студенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.Группы</types>
      </type>
    </attributes>
    <attributes>
      <name>Семестр</name>
      <type>
        <types>EnumRef.Семестры</types>
      </type>
    </attributes>
    <attributes>
      <name>Специальность</name>
      <type>
        <types>CatalogRef.Специальности</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПросроченныхЗадолженностей</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммарноеВремяПросрочки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодЗадолженностейС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодЗадолженностейПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БылковДА70180166/src/AccumulationRegisters/ПросроченныеЗадолженности/ПросроченныеЗадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПросроченныеЗадолженности</name>
  <resources>
    <name>КоличествоПросроченныхЗадолженностей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Семестр</name>
    <type>
      <types>CatalogRef.Семестры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БылковДА70180166/src/Documents/ПриказОбОтчислении/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПросроченныеЗадолженности Расход
	Движения.ПросроченныеЗадолженности.Записывать = Истина;
	Для Каждого ТекСтрокаОтчисляемыеСтуденты Из ОтчисляемыеСтуденты Цикл
		Движение = Движения.ПросроченныеЗадолженности.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Студент = ТекСтрокаОтчисляемыеСтуденты.Студент;
		Движение.Группа = ТекСтрокаОтчисляемыеСтуденты.Группа;
		Движение.Семестр = ТекСтрокаОтчисляемыеСтуденты.Семестр;
		Движение.КоличествоПросроченныхЗадолженностей = ТекСтрокаОтчисляемыеСтуденты.КоличествоПросроченныхЗадолженностей;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПротоколЗаседанияКомиссии") Тогда
		// Заполнение шапки
		Основание = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
